In [1]:
import pandas as pd
import seaborn as sns 
import matplotlib.pyplot as plt
import numpy as np

In [2]:
a = pd.Series([2, 4, 6, 8])
b = pd.Series([1, 3, 5, 7])

In [3]:
np.sqrt(sum(a - b))

2.0

In [4]:
df = pd.DataFrame(np.random.randint(1, 100, 16).reshape(4, 4), columns=list('efgh'), index=list('abcd'))

In [5]:
df.corr()[df.corr() < 1]

          e         f         g         h
e       NaN -0.078484 -0.329451  0.153556
f -0.078484       NaN  0.942370 -0.109276
g -0.329451  0.942370       NaN -0.351738
h  0.153556 -0.109276 -0.351738       NaN

In [6]:
np.abs(df.corr()[df.corr() < 1]).max().sort_values(ascending=False)

f    0.942370
g    0.942370
h    0.351738
e    0.329451
dtype: float64

In [7]:
abs_corr = np.abs(df.corr())
max_corr = abs_corr.apply(lambda x: sorted(x)[-2])
print('Максимальное значение корреляции для каждого столбца: ', np.round(max_corr.tolist(), 2))

Максимальное значение корреляции для каждого столбца:  [0.33 0.94 0.94 0.35]

In [8]:
abs_corr

          e         f         g         h
e  1.000000  0.078484  0.329451  0.153556
f  0.078484  1.000000  0.942370  0.109276
g  0.329451  0.942370  1.000000  0.351738
h  0.153556  0.109276  0.351738  1.000000

In [9]:
df = pd.DataFrame(np.random.randint(1, 100, 16).reshape(4, 4))

In [10]:
df

    0   1   2   3
0  38  47  58  21
1  66  69  14  58
2  11  98  46  21
3  98  12  90  66

In [11]:
df / df.sum().sum()

          0         1         2         3
0  0.046740  0.057811  0.071341  0.025830
1  0.081181  0.084871  0.017220  0.071341
2  0.013530  0.120541  0.056581  0.025830
3  0.120541  0.014760  0.110701  0.081181

In [12]:
part1 = df.apply(lambda x: ((x - x.mean()) / x.std()).round(2))
print('Первая часть\n', part1)

# Вторая часть решения
part2 = df.apply(lambda x: ((x.max() - x) / (x.max() - x.min())).round(2))
print('Вторая часть\n', part2)

Первая часть
       0     1     2     3
0 -0.41 -0.26  0.19 -0.86
1  0.34  0.34 -1.21  0.69
2 -1.13  1.14 -0.19 -0.86
3  1.20 -1.23  1.21  1.03
Вторая часть
       0     1     2     3
0  0.69  0.59  0.42  1.00
1  0.37  0.34  1.00  0.18
2  1.00  0.00  0.58  1.00
3  0.00  1.00  0.00  0.00

In [13]:
tmp = df.apply(lambda x: (x - x.mean()) / x.std()).apply(lambda x: ((x.max() - x)/(x.max() - x.min())).round(2))

In [14]:
tmp

      0     1     2     3
0  0.69  0.59  0.42  1.00
1  0.37  0.34  1.00  0.18
2  1.00  0.00  0.58  1.00
3  0.00  1.00  0.00  0.00

In [15]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})

df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

In [16]:
df1

    fruit  weight  price
0   apple     low     82
1  banana  medium     70
2  orange    high     96
3   apple     low     10
4  banana  medium     23
5  orange    high     53
6   apple     low     21
7  banana  medium     72
8  orange    high     71

In [17]:
df2

    frukt   ves  price
0   apple   low     41
1  banana  high     40
2   melon   low     82
3   apple  high      9
4  banana   low     13
5   melon  high     87

In [50]:
df1.merge(df2, how='inner', left_on=['fruit', 'weight'], right_on=['frukt', 'ves'])

   fruit weight  price_x  frukt  ves  price_y
0  apple    low       41  apple  low       47
1  apple    low       18  apple  low       47
2  apple    low       69  apple  low       47

In [51]:

pd.merge(df1, df2, how='inner', left_on=['fruit', 'weight'], right_on=['frukt', 'ves'], suffixes=['_left', '_right'])

   fruit weight  price_left  frukt  ves  price_right
0  apple    low          41  apple  low           47
1  apple    low          18  apple  low           47
2  apple    low          69  apple  low           47

In [40]:
df1

    fruit  weight  price
0   apple     low     22
1  banana  medium     62
2  orange    high     58
3   apple     low     29
4  banana  medium     19
5  orange    high     24
6   apple     low     59
7  banana  medium     93
8  orange    high     16

In [61]:
df = pd.DataFrame(np.random.randint(1, 10, 16).reshape(4, 4), columns=list('abcd'))

In [62]:
df

   a  b  c  d
0  4  4  2  6
1  2  5  2  7
2  9  3  2  3
3  3  8  1  5

In [82]:
pd.value_counts(df.values.ravel())

2    4
3    3
4    2
5    2
6    1
7    1
9    1
8    1
1    1
dtype: int64

In [84]:
df = pd.DataFrame(np.random.randint(1, 100, 16).reshape(4, 4), columns=list('efgh'), index=list('abcd'))
df

    e   f   g   h
a  96  43  21  56
b  98  88  40  88
c  25  98  21  78
d   4  98  62  97

In [ ]:
from sklearn